# Pandas merging and joining

Pandas has full-featured, high performance in-memory join operations that are very similar to relational databases like SQL. These methods perform significantly better than other open source implementations like base::merge.data.frame in R. The reason for this is careful algorithmic design and the internal layout of the data in DataFrame.

Pandas provides a single function, merge, as the entry point for all standard database join operations between DataFrame objects.

The syntax of the merge function is as follows:-

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True)

The description of the parameters used is as follows−

left − A DataFrame object.

right − Another DataFrame object.

on − Columns (names) to join on. Must be found in both the left and right DataFrame objects.

left_on − Columns from the left DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

right_on − Columns from the right DataFrame to use as keys. Can either be column names or arrays with length equal to the length of the DataFrame.

left_index − If True, use the index (row labels) from the left DataFrame as its join key(s). In case of a DataFrame with a MultiIndex (hierarchical), the number of levels must match the number of join keys from the right DataFrame.

right_index − Same usage as left_index for the right DataFrame.

how − One of 'left', 'right', 'outer', 'inner'. Defaults to inner.

sort − Sort the result DataFrame by the join keys in lexicographical order. Defaults to True, setting to False will improve the performance substantially in many cases.

Now, I will create two different DataFrames and perform the merging operations on them as follows

In [2]:
# let's create two dataframes
import pandas as pd
import numpy as np
batsmen = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Rohit', 'Dhawan', 'Virat', 'Dhoni', 'Kedar'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

bowler = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Kumar', 'Bumrah', 'Shami', 'Kuldeep', 'Chahal'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})


print(batsmen)


print(bowler)

   id    Name subject_id
0   1   Rohit       sub1
1   2  Dhawan       sub2
2   3   Virat       sub4
3   4   Dhoni       sub6
4   5   Kedar       sub5
   id     Name subject_id
0   1    Kumar       sub2
1   2   Bumrah       sub4
2   3    Shami       sub3
3   4  Kuldeep       sub6
4   5   Chahal       sub5

In [4]:
#Merge batsmen and bowler via id
pd.merge(batsmen, bowler, on ="id")

   id  Name_x subject_id_x   Name_y subject_id_y
0   1   Rohit         sub1    Kumar         sub2
1   2  Dhawan         sub2   Bumrah         sub4
2   3   Virat         sub4    Shami         sub3
3   4   Dhoni         sub6  Kuldeep         sub6
4   5   Kedar         sub5   Chahal         sub5

In [6]:
# Merge two dataframes on multiple keys
pd.merge(batsmen,bowler, on=["id","subject_id"])

   id Name_x subject_id   Name_y
0   4  Dhoni       sub6  Kuldeep
1   5  Kedar       sub5   Chahal

# Merge using 'how' argument

The how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or the right tables, the values in the joined table will be NA.

Here is a summary of the how options and their SQL equivalent names −

Merge Method - SQL Equivalent - Description

left - LEFT OUTER JOIN - Use keys from left object

right - RIGHT OUTER JOIN - Use keys from right object

outer - FULL OUTER JOIN - Use union of keys

inner - INNER JOIN - Use intersection of keys

In [7]:
# left join

pd.merge(batsmen, bowler, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y   Name_y
0     1   Rohit       sub1   NaN      NaN
1     2  Dhawan       sub2   1.0    Kumar
2     3   Virat       sub4   2.0   Bumrah
3     4   Dhoni       sub6   4.0  Kuldeep
4     5   Kedar       sub5   5.0   Chahal

In [8]:
# right join

pd.merge(batsmen, bowler, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y   Name_y
0   2.0  Dhawan       sub2     1    Kumar
1   3.0   Virat       sub4     2   Bumrah
2   NaN     NaN       sub3     3    Shami
3   4.0   Dhoni       sub6     4  Kuldeep
4   5.0   Kedar       sub5     5   Chahal

In [9]:
# outer join

pd.merge(batsmen, bowler, on='subject_id', how='outer')

   id_x  Name_x subject_id  id_y   Name_y
0   1.0   Rohit       sub1   NaN      NaN
1   2.0  Dhawan       sub2   1.0    Kumar
2   NaN     NaN       sub3   3.0    Shami
3   3.0   Virat       sub4   2.0   Bumrah
4   5.0   Kedar       sub5   5.0   Chahal
5   4.0   Dhoni       sub6   4.0  Kuldeep

In [10]:
# inner join

pd.merge(batsmen, bowler, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y   Name_y
0     2  Dhawan       sub2     1    Kumar
1     3   Virat       sub4     2   Bumrah
2     4   Dhoni       sub6     4  Kuldeep
3     5   Kedar       sub5     5   Chahal

# Pandas concatenation operation


Pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects.

The concat() function does all of the heavy lifting of performing concatenation operations along an axis while performing optional set logic (union or intersection) of the indexes (if any) on the other axes.

The syntax of the concat() function is as follows:-

pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, copy=True)

In [11]:
batsmen = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Rohit', 'Dhawan', 'Virat', 'Dhoni', 'Kedar'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

bowler = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Kumar', 'Bumrah', 'Shami', 'Kuldeep', 'Chahal'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})


print(batsmen)


print(bowler)

   id    Name subject_id
0   1   Rohit       sub1
1   2  Dhawan       sub2
2   3   Virat       sub4
3   4   Dhoni       sub6
4   5   Kedar       sub5
   id     Name subject_id
0   1    Kumar       sub2
1   2   Bumrah       sub4
2   3    Shami       sub3
3   4  Kuldeep       sub6
4   5   Chahal       sub5

In [12]:
# concatenate the dataframes


team=[batsmen, bowler]

pd.concat(team)

   id     Name subject_id
0   1    Rohit       sub1
1   2   Dhawan       sub2
2   3    Virat       sub4
3   4    Dhoni       sub6
4   5    Kedar       sub5
0   1    Kumar       sub2
1   2   Bumrah       sub4
2   3    Shami       sub3
3   4  Kuldeep       sub6
4   5   Chahal       sub5

In [13]:
# associate keys with the dataframes

pd.concat(team, keys=['x', 'y'])

     id     Name subject_id
x 0   1    Rohit       sub1
  1   2   Dhawan       sub2
  2   3    Virat       sub4
  3   4    Dhoni       sub6
  4   5    Kedar       sub5
y 0   1    Kumar       sub2
  1   2   Bumrah       sub4
  2   3    Shami       sub3
  3   4  Kuldeep       sub6
  4   5   Chahal       sub5

We can see that the index changes completely and the Keys are also overridden.

If two objects need to be added along axis=1, then the new columns will be appended as follows:-

In [14]:
pd.concat(team, axis=1)

   id    Name subject_id  id     Name subject_id
0   1   Rohit       sub1   1    Kumar       sub2
1   2  Dhawan       sub2   2   Bumrah       sub4
2   3   Virat       sub4   3    Shami       sub3
3   4   Dhoni       sub6   4  Kuldeep       sub6
4   5   Kedar       sub5   5   Chahal       sub5

# Concatenating using contact


A useful shortcut to concat are the concat instance methods on Series and DataFrame. These methods actually predated concat. They concatenate along axis=0, namely the index as follows:−

In [19]:
import pandas as pd

batsmen = pd.concat([batsmen, bowler], ignore_index=True)
print(batsmen)

    id     Name subject_id
0    1    Rohit       sub1
1    2   Dhawan       sub2
2    3    Virat       sub4
3    4    Dhoni       sub6
4    5    Kedar       sub5
5    1    Kumar       sub2
6    2   Bumrah       sub4
7    3    Shami       sub3
8    4  Kuldeep       sub6
9    5   Chahal       sub5
10   1    Kumar       sub2
11   2   Bumrah       sub4
12   3    Shami       sub3
13   4  Kuldeep       sub6
14   5   Chahal       sub5

# Reshaping by stacking and unstacking

Stacking means "pivot" a level of the (possibly hierarchical) column labels, returning a DataFrame with an index with a new inner-most level of row labels. So. stacking a dataframe means moving or pivoting the innermost column index to become the innermost row index.

It return a reshaped dataframe or series having a multi-level index with one or more new inner-most levels compared to the current dataframe. The new inner-most levels are created by pivoting the columns of the current dataframe.

if the columns have a single level, the output is a Series.

if the columns have multiple levels, the new index level(s) is (are) taken from the prescribed level(s) and the output is a DataFrame.

In [21]:
cols=pd.MultiIndex.from_tuples([('weight', 'kg'), ('weight', 'pounds')])

df15=pd.DataFrame([[75,165], [60, 132]],
                 index=['husband', 'wife'],
                 columns=cols)

df15

        weight
            kg pounds
husband     75    165
wife        60    132

In [22]:
df16=df15.stack()

df16

C:\Users\user\AppData\Local\Temp\ipykernel_10104\2970729626.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df16=df15.stack()

                weight
husband kg          75
        pounds     165
wife    kg          60
        pounds     132

# Unstacking

It is the inverse operation of stacking. It means "pivot" a level of the (possibly hierarchical) row index to the column axis, producing a reshaped dataframe with a new inner-most level of column labels.

I will convert the stacked dataframe df16 back to original form as follows:-

In [23]:
df16.unstack()

        weight
            kg pounds
husband     75    165
wife        60    132

# Options and customization with pandas

Pandas provide API to customize some aspects of its behavior. In most cases, we would like to adjust the display related options.

The API is composed of five relevant functions. They are as follows :−

get_option()
set_option()
reset_option()
describe_option()
option_context()

# get_option(param)

In [24]:
# display maximum rows

pd.get_option("display.max_rows")

60

In [25]:
# display maximum columns

pd.get_option("display.max_columns")

20

# set_option(param,value)

In [26]:
# set maximum rows

pd.set_option("display.max_rows", 80)

pd.get_option("display.max_rows")

80

In [27]:
# set maximum columns

pd.set_option("display.max_columns", 30)

pd.get_option("display.max_columns")

30

# reset_option(param)

In [28]:
# display maximum rows

pd.reset_option("display.max_rows")

pd.get_option("display.max_rows")

60

In [29]:
# display maximum columns

pd.reset_option("display.max_columns")

pd.get_option("display.max_columns")

20

# describe_option(param)

In [30]:
# description of the display maximum rows parameter

pd.describe_option("display.max_rows")

display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]

# option_context()

option_context() context manager is used to set the option in with statement temporarily. Option values are restored automatically when you exit with block.

In [32]:
#set the parameter value with option_context

with pd.option_context("display.max_rows",10):
   print(pd.get_option("display.max_rows"))
   print(pd.get_option("display.max_rows"))

10
10

There is a difference between the first and the second print statements. The first statement prints the value set by option_context() which is temporary within the with context itself. After the with context, the second print statement prints the configured value.